#ifndef _user_spi_h_
#define _user_spi_h_
 
/*头文件移植无需改动*/
 
/*************************************************************************/
/*SPI引脚初始化函数,移植需在.C文件改动*/
/*************************************************************************/
 
void user_spi_init(void);
 
/*************************************************************************/
 
 
 
/***********************************************************************/
/*移植无需改动,函数实现SPI的脚位电平设置,无需改动*/
/***********************************************************************/
 
void spi_sck_set(unsigned char IOvalue);
void spi_mosi_set(unsigned char IOvalue);
unsigned char spi_miso_read(void);
 
/***********************************************************************/
 
/***********************************************************************/
/*实际IO模拟主要引用这三个函数,无需改动*/
/***********************************************************************/
 
void user_spi_start(unsigned char spi_id);
void user_spi_stop(unsigned char spi_id);
unsigned char user_spi_swap_byte(unsigned char spi_mode,unsigned char send_byte);
 
/***********************************************************************/
#endif
 

